In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#Let's make a dframe
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})

#Show
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636
2  Y  alpha  0.200481  1.299695
3  Y   beta -0.810402 -1.354880
4  Z  alpha -0.995624  0.694329

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [4]:
group1

In [5]:
group1.mean()

k1
X    1.494530
Y   -0.304961
Z   -0.995624
Name: dataset1, dtype: float64

In [6]:

cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [7]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.839561
    JAN    0.200481
NY  FEB   -0.810402
    JAN    0.576937
Name: dataset1, dtype: float64

In [8]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636
2  Y  alpha  0.200481  1.299695
3  Y   beta -0.810402 -1.354880
4  Z  alpha -0.995624  0.694329

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   1.494530 -0.205763
Y  -0.304961 -0.027593
Z  -0.995624  0.694329

In [10]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  2.149499  0.368110
   beta   0.839561 -0.779636
Y  alpha  0.200481  1.299695
   beta  -0.810402 -1.354880
Z  alpha -0.995624  0.694329

In [11]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [12]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636
2  Y  alpha  0.200481  1.299695
3  Y   beta -0.810402 -1.354880
4  Z  alpha -0.995624  0.694329

In [13]:
for name,group in dframe.groupby('k1'):
    print ("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  0.200481  1.299695
3  Y   beta -0.810402 -1.354880


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.995624  0.694329

In [15]:

for (k1,k2),group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s" %(k1,k2))
    print(group)
    print('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  2.149499   0.36811


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  0.839561 -0.779636


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha  0.200481  1.299695


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -0.810402  -1.35488


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.995624  0.694329

In [16]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636
2  Y  alpha  0.200481  1.299695
3  Y   beta -0.810402 -1.354880
4  Z  alpha -0.995624  0.694329

In [17]:
group_dict = dict(list(dframe.groupby('k1')))

In [19]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha  2.149499  0.368110
1  X   beta  0.839561 -0.779636

In [20]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [21]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  2.149499  0.368110
 1  0.839561 -0.779636
 2  0.200481  1.299695
 3 -0.810402 -1.354880
 4 -0.995624  0.694329,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [22]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.368110
   beta  -0.779636
Y  alpha  1.299695
   beta  -1.354880
Z  alpha  0.694329